{"company":[{"id":"43","name":"Firebase","summary":"Firebase is a cloud service designed to power real-time, collaborative applications. Simply&nbsp;add the Firebase library&nbsp;to your application to gain access to a shared data structure; any changes you make to that data are automatically synchronized with the Firebase cloud and with other clients within milliseconds. Apps built with Firebase can be written entirely with client-side JavaScript,","details":"Firebase is a cloud service designed to power real-time, collaborative applications. Simply&nbsp;add the Firebase library&nbsp;to your application to gain access to a shared data structure; any changes you make to that data are automatically synchronized with the Firebase cloud and with other clients within milliseconds. Apps built with Firebase can be written entirely with client-side JavaScript, update in real-time out-of-the-box, interoperate well with existing services, scale automatically, and provide&nbsp;strong data security.\n\nFirebase is designed to help you build great apps quickly, and it's intended for both expert developers as well as those just getting started. It has five core concepts:\n1. Real-time Synchronization\nFirebase takes a new approach to the way data is moved around an app. Rather than using a traditional request \/ response model, it works by synchronizing data between devices. To respond to data changes, you attach callback functions. When data is modified, local callbacks are triggered immediately to ensure your app is responsive regardless of network latency, and remote callbacks are triggered within milliseconds. Synchronized data is also persisted to the Firebase cloud, allowing new clients that connect later to be immediately up-to-date.\n2. Data Accessibility\nData stored in Firebase is easy to access and use from any device. Data is stored as JSON, and&nbsp;every piece of data has its own URL&nbsp;which can be used in three important ways. First, Firebase's client libraries allow you to specify the data to synchronize simply by using the appropriate URL. Second, every Firebase URL can be&nbsp;entered into a browser&nbsp;to view the data and watch it update in real-time. Finally, every Firebase URL acts as a&nbsp;REST endpoint&nbsp;to allow for easy integration with any existing service.\n3. Automatic Scaling\nThe Firebase API is built from the ground up for performance and scale. You simply specify which data you would like to synchronize with each client, and Firebase calculates the minimum set of updates that need to be sent to keep everyone in sync. In addition, all Firebase API functions are designed to scale linearly with the size of the data being synchronized and to shard well into a distributed cloud environment. More importantly, Firebase handles all of the scaling and operations for you. Your Firebase app will scale automatically from its first user to its first million without needing any code changes.\n4. First-class Data Security\nUnlike traditional applications that intermix security code with application code, Firebase treats security as a first-class feature. You define your security policies in one place using a&nbsp;flexible rules language, and Firebase ensures that these policies are consistently enforced across all parts of your application. Having all security logic in one place allows for easy auditing and helps you avoid security mistakes. In addition, Firebase supports SSL on all clients, uses strong cryptographic hashes for signatures, applies modern best practices when managing passwords, and handles all of the other mundane but important details of keeping your data safe.\n5. Servers are Optional\nFirebase's synchronization approach and first-class security features can provide all of the data storage, control, and transmission needs of most apps. In fact, in many cases, Firebase can completely replace your server-side components. This means that you no longer need to build complicated backend software and can instead build your apps entirely with client-side HTML, CSS, and JavaScript.\nThis does not mean, however, that you can't run your own servers. Firebase plays nicely with existing systems through its&nbsp;REST API&nbsp;and&nbsp;Node.js library.","website":"http:\/\/www.firebase.com\/docs\/rest-api.html","twitter":"https:\/\/twitter.com\/Firebase","github":"https:\/\/github.com\/firebase","blog":"http:\/\/blog.firebase.com\/","blogrss":"","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/firebase-logo.png","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/ap-evangelist-site\/api\/screenshots\/5458_firebase.png","tags":"Enterprise,JavaScript,Network,Real-Time"},{"id":"98","name":"PubNub","summary":"PubNub is a blazingly fast cloud-hosted messaging service for building real-time web and mobile apps. Hundreds of apps and thousands of developers rely on PubNub for delivering &ldquo;human-perceptive&rdquo; real-time experiences that scale to millions of users worldwide. PubNub delivers the infrastructure needed to build amazing MMO games, social apps, business collaborative solutions, and more.","details":"PubNub is a blazingly fast cloud-hosted messaging service for building real-time web and mobile apps. Hundreds of apps and thousands of developers rely on PubNub for delivering &ldquo;human-perceptive&rdquo; real-time experiences that scale to millions of users worldwide. PubNub delivers the infrastructure needed to build amazing MMO games, social apps, business collaborative solutions, and more.","website":"http:\/\/www.pubnub.com\/devcenter","twitter":"https:\/\/twitter.com\/pubnub","github":"https:\/\/github.com\/pubnub","blog":"http:\/\/blog.pubnub.com","blogrss":"http:\/\/blog.pubnub.com\/feed\/","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/pubnub-large.png","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/api\/pubnub-screenshot.png","tags":"HTTP,Messaging,Mobile,Real-Time"},{"id":"549","name":"Beacon Push","summary":"Beaconpush is a push service for creating real-time web apps using HTML5 WebSockets and Comet. Beaconpush changes the traditional request-response flow of the web by creating a persistent real-time message stream to each of your visitors. Enabling you to reach your visitors without requiring them to constantly poll your website.","details":"Beaconpush is a push service for creating real-time web apps using HTML5 WebSockets and Comet. Beaconpush changes the traditional request-response flow of the web by creating a persistent real-time message stream to each of your visitors. Enabling you to reach your visitors without requiring them to constantly poll your website.","website":"http:\/\/beaconpush.com\/guide\/rest-api\/","twitter":"https:\/\/twitter.com\/beaconpush","github":"","blog":"","blogrss":"http:\/\/pushingtheweb.com\/feed\/","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/beacon-push.png","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/ap-evangelist-site\/api\/screenshots\/2266_beacon_push.png","tags":"Messaging,Notifications,Realtime,Stack"},{"id":"89","name":"SuperFeedr","summary":"Superfeedr fetches and parses RSS or Atom feeds on behalf of its users and then pushes them the new entries in these feeds. Superfeedr implements most of the current Real-time technologies and guarantees an entry detection time inferior to 15 min. Superfeedr has both an XMPP and a PubSubHubbub API.","details":"Superfeedr fetches and parses RSS or Atom feeds on behalf of its users and then pushes them the new entries in these feeds. Superfeedr implements most of the current Real-time technologies and guarantees an entry detection time inferior to 15 min. Superfeedr has both an XMPP and a PubSubHubbub API.","website":"http:\/\/superfeedr.com","twitter":"http:\/\/twitter.com\/superfeedr","github":"https:\/\/github.com\/superfeedr","blog":"http:\/\/blog.superfeedr.com\/","blogrss":"http:\/\/blog.superfeedr.com\/atom.xml","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/superfeedr-logo.png","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/ap-evangelist-site\/api\/screenshots\/1693_superfeedr.png","tags":"Feed,Feeds,internet,PubSubHubbub,Real-Time,Realtime,REST,RSS,RSS,subscriptions,XMPP"},{"id":"1372","name":"BrightContext","summary":"BrightContext provides an ultra-scalable, cloud-based platform for software developers to filter and perform calculations on streams of data in-flight, and power real-time data communication in apps. Our platform makes it easy for developers to build applications that ingest large volumes of real-time data, process the data on the fly, and instantly broadcast results among large numbers of users.&","details":"BrightContext provides an ultra-scalable, cloud-based platform for software developers to filter and perform calculations on streams of data in-flight, and power real-time data communication in apps. Our platform makes it easy for developers to build applications that ingest large volumes of real-time data, process the data on the fly, and instantly broadcast results among large numbers of users.&nbsp;","website":"http:\/\/www.brightcontext.com\/","twitter":"https:\/\/twitter.com\/brightcontext","github":"https:\/\/github.com\/BrightContext","blog":"http:\/\/www.brightcontext.com\/category\/blog\/","blogrss":"http:\/\/www.brightcontext.com\/feed\/","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/1372_logo.png","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/ap-evangelist-site\/api\/screenshots\/7463_brightcontext.png","tags":"Data,Real-Time,Stack"},{"id":"44","name":"Pusher","summary":"Pusher is a hosted service that allows developers to quickly and easily add realtime functionality into their web and mobile applications.\nOur goal is to take away the management and operations of a company's realtime infrastructure, so that developers can focus energy on the features of their product that make them unique.\nRealtime is an important trend in application development and leads to gre","details":"Pusher is a hosted service that allows developers to quickly and easily add realtime functionality into their web and mobile applications.\nOur goal is to take away the management and operations of a company's realtime infrastructure, so that developers can focus energy on the features of their product that make them unique.\nRealtime is an important trend in application development and leads to greater engagement and retention with your customers. Our service allows people to stay involve with an application, getting new data as it is created without having to refresh.\nWe provide&nbsp;client libraries&nbsp;for HTML5, iOS and Android to allow clients to connect to our service, and a simple REST API for publishing messages to them from your server (we have libraries&nbsp;in lots of languages). We allow developers to have the benefits of realtime without having to re-architect their applications, or learn new languages and frameworks.\nOur customers use the service to build games, collaborative tools, social networks and we are used by startups and large companies alike.\nPlease&nbsp;get in touch with us&nbsp;if you want to understand how your applications can benefit from being realtime.\nAlternatively, sign up for a FREE account and see how easy it is to start pushing messages to your applications.","website":"http:\/\/pusher.com\/docs","twitter":"https:\/\/twitter.com\/pusher","github":"https:\/\/github.com\/pusher","blog":"http:\/\/blog.pusher.com\/","blogrss":"http:\/\/feeds.feedburner.com\/pusherblog","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/pusher-logo.png","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/ap-evangelist-site\/api\/screenshots\/2925_pusher.png","tags":"HTML5,Infrastructure,JSON,Real-Time,Real-Time,Realtime,Tools,WebSockets,WebSockets"}],"published":"05\/24\/2013"}