{
    "news": [
        {
            "title": "The PubNub Real-Time Network Joins Forces with Windows Azure Mobile Services Platform",
            "details": "  Real-time just got a whole lot easier for.  NET developers everywhere as the super-fast PubNub Real-Time Network is now available as an add-on through the Windows Azure Mobile Services platform.  Now Windows Azure users can leverage the PubNub Network to add real-time experiences to both new and existing apps.  Using a simple API, with just a few lines of code, any app has instant access to powerful real-time features such as:\n Real-Time Data – Broadcast to millions of users at a time or to individual devices all in less than.  25 seconds\n Presence Detection – Instantly know everyone using an app and automatically detect when additional users join or other users leave\n Data Visualization – Get better insights with streaming real-time data visualization\n \n Some of the many uses for PubNub include deepening second screen interactions in Social TV apps like Viggle, powering new wave telecommunications services like Rebtel and improving engagement with the real-time voting associated with many new advertising campaigns.",
            "item_date": "Mar 14 2013 07:00:00",
            "display_item_date": "03-14-2013",
            "url": "http://blog.pubnub.com/pubnub-windows-azure/",
            "source": "blog.pubnub.com",
            "tags": "API-Evangelist, API-Stack, Azure, Real-Time, Windows"
        },
        {
            "title": "Livefyre Comments 3: The WordPress Plugin has arrived",
            "details": "  The engineering team is high-fiving, and the beers are clinking, it’s time to announce the release of our Livefyre Comments 3 plugin for self-hosted WordPress sites.  With this release all of our supported platforms are now on Comments 3, and we saved the best for last.  Many of you have helped with the beta testing of Comments 3, and we’re very excited to share some of the features that we have added to the Comments 3 WordPress plugin that were built from your feedback, suggestions and ideas.  Upgrading to Comments 3 is as simple as clicking on the upgrade prompt in your WordPress admin dashboard.  All of your posts and comments will be automatically be transitioned to Comments 3 and your readers will be interacting with the same widget across your site.",
            "item_date": "Mar 08 2013 08:00:00",
            "display_item_date": "03-08-2013",
            "url": "http://blog.livefyre.com/livefyre-comments-3-the-wordpress-plugin-has-arrived/",
            "source": "blog.livefyre.com",
            "tags": "API-Evangelist, API-Stack, Real-Time, Social, Wordpress"
        },
        {
            "title": "Static files hosting with SSL on custom domain",
            "details": "  SubToMe is a universal subscribe button.  One of its key design goals was to use only static files.  There should be no server involved: it’s not an app, it’s a button.  Another key aspects of the SubToMe button is that it’s included on many page, and needs to be able to run on any page (thanks to the bookmarklet), including https pages.  With that in mind, we are forced to host the button on a system that supports SSL.",
            "item_date": "Mar 08 2013 08:00:00",
            "display_item_date": "03-08-2013",
            "url": "http://blog.superfeedr.com/asset-hosting-ssl-domain",
            "source": "blog.superfeedr.com",
            "tags": "API-Evangelist, API-Stack, File Storage, Real-Time"
        },
        {
            "title": "Using Pusher to power cisimple’s real-time API",
            "details": "  Here at cisimple we’re really excited to be announcing the first release of our API.  We’ve exposed functionality giving our users a new level of control over build processes for their mobile applications.  It’s now possible to kick off new builds, download artifacts and more, all via API calls.  One thing we’re doing a bit different from most API’s is that we’re allowing clients to register for real time updates via Pusher channels.  We’ve had several folks ping us, interested in developing apps that respond to build activity (i.",
            "item_date": "Mar 06 2013 08:00:00",
            "display_item_date": "03-06-2013",
            "url": "http://blog.pusher.com/using-pusher-to-power-cisimples-real-time-api/",
            "source": "blog.pusher.com",
            "tags": "API-Evangelist, API-Stack, Build, Mobile, Pusher, Real-Time, Software Development, Story"
        },
        {
            "title": "The Argument for Real-Time REST APIs",
            "details": "  This guest post comes from Bryan Helmig, a self-taught hacker and co-founder of Zapier.  By day he hacks on APIs, by night he hacks on APIs (its kind of his thing).  Read more at Zapier’s blog and bryanhelmig.  com.  APIs enable incredible customization.",
            "item_date": "Mar 06 2013 00:43:26",
            "display_item_date": "03-05-2013",
            "url": "http://blog.programmableweb.com/2013/03/05/the-argument-for-real-time-rest-apis/",
            "source": "blog.programmableweb.com",
            "tags": ", API-Evangelist, API-Stack, Real-Time, Webhooks"
        },
        {
            "title": "The Argument for Real-Time REST APIs",
            "details": "  This guest post comes from Bryan Helmig, a self-taught hacker and co-founder of Zapier.  By day he hacks on APIs, by night he hacks on APIs (its kind of his thing).  Read more at Zapier’s blog and bryanhelmig.  com.  APIs enable incredible customization.",
            "item_date": "Mar 05 2013 08:00:00",
            "display_item_date": "03-05-2013",
            "url": "http://blog.programmableweb.com/2013/03/05/the-argument-for-real-time-rest-apis/",
            "source": "blog.programmableweb.com",
            "tags": "API-Evangelist, API-Stack, Real-Time, Zapier"
        },
        {
            "title": "Nginx switches on to WebSockets",
            "details": "  Nginx, the lightweight open-source web server, has added support for the WebSocket protocol as part of its 1.  3.  13 release.  WebSockets are a major feature of the HTML5 specification, allowing persistent connections to be maintained between the server and client - particularly useful for online games and IRC clients.  With the specification finalised, the WebSocket protocol is now supported by practically all web browsers, as well as Java servers GlassFish, Jetty and Tomcat.",
            "item_date": "Feb 20 2013 23:53:10",
            "display_item_date": "02-20-2013",
            "url": "http://jaxenter.com/nginx-switches-on-to-websockets-46260.html",
            "source": "jaxenter.com",
            "tags": ", API-Evangelist, API-Stack, HTML5, Real-Time, WebSockets"
        },
        {
            "title": "Pusher Now Available Through Windows Azure Mobile Services Platform",
            "details": "  We’re pleased to announce that Pusher is now available as an add-on to Windows Azure Mobile Services apps through the Microsoft Windows Azure Store.  With this partnership it’s now possible to add realtime web functionality that goes far beyond simple notifications, to offering the potential for much richer interactive and collaborate application experiences.  Our first tutorial covers how to synchronise Todo list data between Windows Azure and an iOS app.  It does this by using Mobile Services server scripts which listen to Windows Azure data change events (think database triggers).  When these events occur the Pusher node.",
            "item_date": "Jan 28 2013 08:00:00",
            "display_item_date": "01-28-2013",
            "url": "http://blog.pusher.com/pusher-on-windows-azure/",
            "source": "blog.pusher.com",
            "tags": "API-Evangelist, API-Stack, Azure, Pusher, Real-Time"
        },
        {
            "title": "Building Streaming REST APIs with Ruby",
            "details": "  Twitter popularized the term firehose API, to mean a realtime stream of data sent through a persistent connection.  But even if youre not a realtime service, streaming APIs are great for pushing data from the backend to clients.  They reduce resource usage because the server can decide when its a good time to send a incremental chunk of data.  They can also improve the responsiveness of your user experience.  The same HTTP API can be reused to power multiple different apps.",
            "item_date": "May 24 2012 22:19:33",
            "display_item_date": "05-24-2012",
            "url": "http://intridea.com/blog/2012/5/24/building-streaming-rest-apis-with-ruby",
            "source": "intridea.com",
            "tags": "API, Real-Time, Ruby"
        },
        {
            "title": "Superfeedr : Protocols over APIs",
            "details": "  There is not a week where I don’t see developers discovering that a given API has been deprecated.  Today’s disappointment (at least in my twitter stream) comes from the Google Chart Tool API.  Don’t get me wrong.  I feel for these developers and I would be upset should the same problem happen to me.  Now, being upset is great.",
            "item_date": "May 15 2012 17:32:49",
            "display_item_date": "05-15-2012",
            "url": "http://blog.superfeedr.com/protocols-over-api/",
            "source": "blog.superfeedr.com",
            "tags": "API, protocol, Real-Time, Standard, unified"
        },
        {
            "title": "Introducing SwaggerSocket: A REST over WebSocket Protocol",
            "details": "  REST is a style of software architecture which is almost always delivered over HTTP.   It powers most of the World Wide Web and has enabled the rapid construction of APIs–it has allowed developers to easily integrate many complex services with their applications.   It has been truly transformational over the last 10 years.  The problem is, HTTP is a chatty, synchronous communication protocol based entirely on “request/response”.   That is, there is no easy way to open continuous communication between a client and a server.",
            "item_date": "Apr 27 2012 03:35:56",
            "display_item_date": "04-26-2012",
            "url": "http://blog.wordnik.com/introducing-swaggersocket-a-rest-over-websocket-protocol",
            "source": "blog.wordnik.com",
            "tags": "HTML5, Real-Time, Swagger, WebSocket, Wordnik"
        }
    ],
    "published": "03/20/2013",
    "newscount": 11
}